homepage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Digital Agenda Scoreboard - Development Environment</title>
<!-- 2015-11-12 do 09:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>




</head>
<body>
<div id="content">
<h1 class="title">Digital Agenda Scoreboard - Development Environment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. SSL Certificate Generation</a></li>
<li><a href="#sec-3">3. Building/Installing the system</a></li>
<li><a href="#sec-4">4. Starting the Services</a></li>
<li><a href="#sec-5">5. Environment Details</a></li>
<li><a href="#sec-6">6. Development Environment</a></li>
<li><a href="#sec-7">7. Account Details</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Once installed there is no requirement to rebuild the system each time
and only the services need to be restarted (using <b>sudo
/vagrant/scripts/setup.sh -S</b>). Once restarted, the following should be
accessible:
</p>

<ul class="org-ul">
<li><a href="http://www.digital-agenda-data.eu/">Digital Agenda Scoreboard (homepage)</a>
</li>
<li><a href="http://www.digital-agenda-data.eu/data">Digital Agenda Scoreboard (data)</a>
</li>
<li><a href="http://semantic.digital-agenda-data.eu/dataset/">Digital Agenda Scoreboard (elda)</a>
</li>
<li><a href="http://localhost:1111/sparql">Virtuoso Sparql Endpoint</a>
</li>
<li><a href="http://localhost:8890/">Virtuoso Conductor</a>
</li>
<li>Supervisor
</li>
<li><a href="http://localhost:8080/">Tomcat</a>
</li>
<li><a href="http://localhost/">Apache</a>
</li>
<li>CR     - <a href="http://localhost:8082/data">http://localhost:8082/data</a>
</li>
<li>Plone  - <a href="http://localhost:8440/Plone">http://localhost:8440/Plone</a>
</li>
<li>Elda   - <a href="http://localhost:8080/scoreboard">http://localhost:8080/scoreboard</a>
</li>
</ul>

<p>
Files in /vagrant are shared with the host system, so any files which need
to be backed up or saved, etc. need to be moved there.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> SSL Certificate Generation</h2>
<div class="outline-text-2" id="text-2">
<p>
cd to /vagrant and then follow steps 1 through 4 decribed in:
  <a href="http://www.akadia.com/services/ssh_test_certificate.html">http://www.akadia.com/services/ssh_test_certificate.html</a>.
Once the certificates have been generated, the system can be 
built and installed using the commands below.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Building/Installing the system</h2>
<div class="outline-text-2" id="text-3">
<p>
The build the services and install all the required parts in the
correct place the following can be used.
</p>
<blockquote>
<p>
cd /vagrant ;
sudo scripts/setup.sh
</p>
</blockquote>

<p>
The system will then need to be rebooted. This should only be
necessary once.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Starting the Services</h2>
<div class="outline-text-2" id="text-4">
<p>
This command will be needed each time the system is restarted and it
will only restart the services (no rebuilding of software packages).
</p>

<blockquote>
<p>
cd /vagrant; 
sudo scripts/setup.sh -S
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Environment Details</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Component</th>
<th scope="col" class="right">Version</th>
<th scope="col" class="left">Documentation</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">CentOS</td>
<td class="right">6.5</td>
<td class="left"><a href="http://cents.org/">http://cents.org/</a></td>
<td class="left"><sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>

<tr>
<td class="left">Java</td>
<td class="right">1.6</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Virtuso</td>
<td class="right">6</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Maven</td>
<td class="right">2.0.11</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Python</td>
<td class="right">2.7.8</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Plone</td>
<td class="right">4.3</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Elda</td>
<td class="right">1.2.21</td>
<td class="left">&#xa0;</td>
<td class="left"><sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></td>
</tr>

<tr>
<td class="left">Firefox</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Apache Tomcat</td>
<td class="right">6.0.44</td>
<td class="left">&#xa0;</td>
<td class="left"><sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup></td>
</tr>

<tr>
<td class="left">zope</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">supervisor</td>
<td class="right">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Libevent</td>
<td class="right">2.0.21</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Twisted</td>
<td class="right">15.3.0</td>
<td class="left">&#xa0;</td>
<td class="left"><sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Development Environment</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>services startup
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Account Details</h2>
<div class="outline-text-2" id="text-7">
<p>
usr/lib64/firefox/browser/defaults/preferences/all-redhat.js
</p>

<dl class="org-dl">
<dt> <a href="http://www.digital-agenda-data.eu/data">Digital Agenda Scoreboard (data)</a> </dt><dd><ul class="org-ul">
<li>Login : <i>admin</i>
</li>
<li>Password : <i>admin</i>
</li>
</ul>
</dd>

<dt> <a href="http://semantic.digital-agenda-data.eu/dataset/">Digital Agenda Scoreboard (elda)</a> </dt><dd>  XXX
</dd>

<dt> <a href="http://localhost:1111/sparql">Virtuoso Sparql Endpoint</a> </dt><dd><ul class="org-ul">
<li>Login : <i>dba</i>
</li>
<li>Login : <i>dba</i>
</li>
</ul>
</dd>

<dt> <a href="http://localhost:8890/">Virtuoso Conductor</a> </dt><dd><ul class="org-ul">
<li>Login : <i>dba</i>
</li>
<li>Login : <i>dba</i>
</li>
</ul>
</dd>
</dl>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Superceded by CentOs 7.0
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
Taken from <a href="http://elda.googlecode.com">googlecode</a> which will disappear soon.
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
End-of-life 2015
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
Later versions caused problems (needs retesting now everything works)
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Created: 2015-11-12 do 09:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
